[
  {
    "id": "proj-1",
    "title": "Heart Disease Prediction System",
    "summary": "ML-based prediction model using clinical data to assess heart disease risk.",
    "details": "Built an ML-based prediction model using clinical data to assess heart disease risk.\n\nAchieved 97% sensitivity and 98% specificity using SMOTE and cross-validation techniques.\n\nDeployed the model via Streamlit/Gradio for real-time, user-friendly risk assessment.",
    "image": "https://images.unsplash.com/photo-1559757148-5c350d0d3c56?ixlib=rb-4.0.3&auto=format&fit=crop&w=400&h=250&q=80",
    "tech": ["Machine Learning", "XGBoost", "Python", "Streamlit"],
    "link": "#"
  },
  {
    "id": "proj-2",
    "title": "StartupKart",
    "summary": "Goods taxation and price analysis system to calculate GST and evaluate product costs efficiently.",
    "details": "Developed StartupKart, a goods taxation and price analysis system to calculate GST and evaluate product costs efficiently.\n\nAnalyzed past 10 years of price data to identify trends and support informed purchasing decisions.\n\nImplemented a recommendation feature using historical and live datasets to suggest optimal buying options.",
    "image": "https://images.unsplash.com/photo-1556742049-0cfed4f6a45d?ixlib=rb-4.0.3&auto=format&fit=crop&w=400&h=250&q=80",
    "tech": ["React JS", "HTML", "CSS", "JavaScript"],
    "link": "#"
  },
  {
    "id": "proj-3",
    "title": "ResoNet",
    "summary": "IoT and GIS-enabled platform for MSMEs real-time access, booking, and monitoring of shared industrial infrastructure.",
    "details": "Developed ResoNet, an IoT and GIS-enabled platform to provide MSMEs real-time access, booking, and monitoring of shared industrial infrastructure.\n\nIntegrated low-cost IoT sensors with RFID/QR-based access control and live GIS mapping to improve transparency and resource utilization.\n\nDesigned analytics dashboards to track usage trends, optimize facility management, and reduce production delays.",
    "image": "https://images.unsplash.com/photo-1558494949-ef010cbdcc31?ixlib=rb-4.0.3&auto=format&fit=crop&w=400&h=250&q=80",
    "tech": ["ESP32", "IoT", "GIS", "Leaflet", "RFID", "QR"],
    "link": "#"
  }
]
